## Plan Result (prod_shutter_static_webapp - TerraformPlanApply)




<pre><code>Plan: 5 to add, 9 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;portal&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;portal&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;portal&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;portal&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;portal&#34;]
* Update
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;court-tribunal-hearings&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;darts-portal&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;jd-bureau&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;juror-bureau&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;juror-public&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;pre-portal&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;toffee&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;vh-admin-web&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;vh-video-web&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["portal"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "portal-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "pre-recorded-evidence.justice.gov.uk"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["court-tribunal-hearings"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/court-tribunal-hearings.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["darts-portal"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apps.hmcts.net/TXT/_dnsauth.darts"
        name                = "_dnsauth.darts"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["jd-bureau"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/juror-bureau.justice.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["juror-bureau"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apps.hmcts.net/TXT/_dnsauth.juror"
        name                = "_dnsauth.juror"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["juror-public"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/reply-jury-summons.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["portal"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.portal"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 3600
      + zone_name           = "pre-recorded-evidence.justice.gov.uk"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["pre-portal"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.pre-portal"
        name                = "_dnsauth.pre-portal"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["toffee"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.toffee"
        name                = "_dnsauth.toffee"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["vh-admin-web"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/hearings.reform.hmcts.net/TXT/_dnsauth.admin"
        name                = "_dnsauth.admin"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["vh-video-web"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/hearings.reform.hmcts.net/TXT/_dnsauth.video"
        name                = "_dnsauth.video"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["portal"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "portal"
      + resource_group_name = "sds-platform-shutter-webapp-prod-rg"
      + sku_size            = "Standard"
      + sku_tier            = "Standard"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["portal"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "portal.pre-recorded-evidence.justice.gov.uk"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["portal"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "portal_prod"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 9 to change, 0 to destroy.

Changes to Outputs:
  ~ debug_shutter = [
        # (5 unchanged elements hidden)
        {
            backend_domain   = [
                "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com",
            ]
            certificate_name = "wildcard-platform-hmcts-net"
            custom_domain    = "pre-portal.platform.hmcts.net"
            disabled_rules   = {
                SQLI = [
                    "942200",
                    "942370",
                    "942260",
                    "942340",
                    "942440",
                    "942450",
                    "942110",
                    "942430",
                ]
            }
            dns_zone_name    = "platform.hmcts.net"
            name             = "pre-portal"
        },
      + {
          + backend_domain    = [
              + "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com",
            ]
          + cache_enabled     = "false"
          + certificate_name  = "www-portal-pre-recorded-evidence-justice-gov-uk"
          + custom_domain     = "portal.pre-recorded-evidence.justice.gov.uk"
          + custom_rules      = [
              + {
                  + action           = "Block"
                  + enabled          = true
                  + match_conditions = [
                      + {
                          + match_values       = [
                              + "GB",
                            ]
                          + match_variable     = "RemoteAddr"
                          + negation_condition = true
                          + operator           = "GeoMatch"
                        },
                    ]
                  + name             = "CountryMatchWhitelist"
                  + priority         = 1
                  + type             = "MatchRule"
                },
            ]
          + disabled_rules    = {
              + SQLI = [
                  + "942200",
                  + "942370",
                  + "942260",
                  + "942340",
                  + "942440",
                  + "942450",
                  + "942430",
                ]
            }
          + dns_zone_name     = "pre-recorded-evidence.justice.gov.uk"
          + global_exclusions = [
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "code"
                },
            ]
          + mode              = "Prevention"
          + name              = "portal"
          + shutter_app       = true
        },
        {
            backend_domain   = [
                "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com",
            ]
            cache_enabled    = "false"
            certificate_name = "reply-jury-summons-service-gov-uk"
            custom_domain    = "reply-jury-summons.service.gov.uk"
            disabled_rules   = {
                RCE  = [
                    "932100",
                    "932105",
                    "932110",
                    "932115",
                    "932150",
                ]
                SQLI = [
                    "942100",
                    "942110",
                    "942120",
                    "942150",
                    "942180",
                    "942190",
                    "942200",
                    "942210",
                    "942230",
                    "942240",
                    "942260",
                    "942310",
                    "942340",
                    "942380",
                    "942390",
                    "942400",
                    "942410",
                    "942430",
                    "942440",
                    "942450",
                ]
            }
            dns_zone_name    = "reply-jury-summons.service.gov.uk"
            mode             = "Prevention"
            name             = "juror-public"
            ssl_mode         = "AzureKeyVault"
        },
        # (2 unchanged elements hidden)
    ]
```

</details>





## :warning: Errors

* add a label prod_shutter_static_webapp - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/sds-azure-platform/issues/859/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":859,"Program":"tfcmt","SHA1":"","Target":"prod_shutter_static_webapp - TerraformPlanApply","Vars":{}} -->